In [5]:
print (type(10.8))

<class 'float'>

matematika : 5+1
print (matermatika)

In [7]:
print (type(True))

<class 'bool'>

In [10]:
matematika='1223'
print (matematika)

1223

In [11]:
nama = "Hacktive"
nat= "8"
print (nama + nat)

Hacktive8

In [3]:
s='FaDelII'
print (s.capitalize())
print (s.swapcase())
print (s.lower())

Fadelii
fAdELii
fadelii

In [6]:
(s1, s2, s3, s4) = ('foo', 'bar', 'baz', 'qux')
print (s1)

(s1, s2, s3, s4) = ['foo', 'bar', 'baz', 'qux']
print (s1)

foo
foo

In [7]:
# Perbedaan tuples dengan list
#List
my_list = [1, 2, 3, 4]
my_list.append(5) #-> ini digunakan untuk menambahkan list
print(my_list)

#tuple
my_tuple = (1, 2, 3, 4)
# my_tuple[0] = 5  # Ini akan menghasilkan error karena tuple bersifat immutable
print(my_tuple)

[1, 2, 3, 4, 5]
(1, 2, 3, 4)

In [9]:
# Membuat dictionary
my_dict = {'nama':'Fadeli', 'umur' : 23,'pekerjaan':'BFLP'}

# Mengakses nilai berdasarkan kunci
print(my_dict['nama'])
print(my_dict['umur'])
print(my_dict['pekerjaan'])

# Menambahkan elemen ke dalam dictionary
my_dict['lokasi'] = 'Jakarta'
print(my_dict)

Fadeli
23
BFLP
{'nama': 'Fadeli', 'umur': 23, 'pekerjaan': 'BFLP', 'lokasi': 'Jakarta'}

In [21]:
#CASE 1 -> Jika a lebih besar dari c cetak nilai A, dan jika a lebih kecil dari b cetak betul

a=3 
b=4 
c=1

if a>c:
    print (a)
if a<b:
    print ('betul')
else:
    print ('kemerdekaan adalah hak segala bangsa')

3
betul

In [29]:
#Case 2 -> jika A lebih besar dar B dan lebih besar dari C tampilkan "tampil"

if (a>b) | (a>c):
    print('tampil or')
if (a>b) & (a>c):
    print('tampil and')
else:
    print('Enggak')

tampil or
Enggak

In [33]:
#TUGAS LIST

sistem=['saya','pergi','ke','LPPI','kemang']
engineer=['tidak','jalan','karena','banjir']
print (
sistem[0],engineer[0],sistem[1],engineer[2],engineer[3]
)

engineer[0]='tetap'
print (
sistem[0],engineer[0],sistem[1],engineer[2],engineer[3]
)

saya tidak pergi karena banjir
saya tetap pergi karena banjir

In [3]:
#TUGAS BOOLEAN
a=6
b=7
c=8
if (c>a):
    if (b>c):
        print('true')
    else:
        print('false')
else:
    print('error')

false

In [9]:
#TUGAS TABEL LULUS DAN TIDAK LULUS

daftar_nama = [
    {'nama': 'nama1', 'nilaiA': 80, 'nilaiB': 70},
    {'nama': 'nama2', 'nilaiA': 55, 'nilaiB': 70},
    {'nama': 'nama3', 'nilaiA': 80, 'nilaiB': 90},
    {'nama': 'nama4', 'nilaiA': 75, 'nilaiB': 60},
    {'nama': 'nama5', 'nilaiA': 90, 'nilaiB': 70}
]
for nama in daftar_nama:
    if (nama['nilaiA'] <= 60) | (nama['nilaiB'] <= 60):
        total=nama['nilaiA']+nama['nilaiB']
        nama['total'] = total
        
        nama['keterangan'] = 'gagal'
    else:
        total=nama['nilaiA']+nama['nilaiB']
        nama['total'] = total
        
        nama['keterangan'] = 'lulus'

for nama in daftar_nama:
    print(nama)
    
for nama in

{'nama': 'nama1', 'nilaiA': 80, 'nilaiB': 70, 'total': 150, 'keterangan': 'lulus'}
{'nama': 'nama2', 'nilaiA': 55, 'nilaiB': 70, 'total': 125, 'keterangan': 'gagal'}
{'nama': 'nama3', 'nilaiA': 80, 'nilaiB': 90, 'total': 170, 'keterangan': 'lulus'}
{'nama': 'nama4', 'nilaiA': 75, 'nilaiB': 60, 'total': 135, 'keterangan': 'gagal'}
{'nama': 'nama5', 'nilaiA': 90, 'nilaiB': 70, 'total': 160, 'keterangan': 'lulus'}

In [24]:
#TUGAS LULUS DAN TIDAK LULUS

list_nama={}
list_nama['nama']=input('nama =')
list_nama['hobi']=input('hobi =')
list_nama['email']=input('email =')
list_nama['uts']=int(input('uts ='))
list_nama['uas']=int(input('uas ='))

if ((list_nama['uts']<=60) or (list_nama['uas']<=60)) or (list_nama['uts'] + list_nama['uas'] <= 125):
    list_nama['keterangan']='Gagal'
else:
    list_nama['keterangan']='Lulus'
print(list_nama['keterangan'])

nama =FADELI DWI P
hobi =BASKET
email =dwifadeli11@gmail.com
uts =50
uas =90
Gagal

In [21]:
#TUGAS BINER,DESIMAL,OKTA,HEXA


karakter = ['B','a','T']
for i in karakter:
    
    desimal = ord(i)
# Desimal
    print('Desimal =', desimal)

    # Biner
    biner = ''
    desimal1 = desimal
    while desimal1 > 0:
        sisa = desimal1 % 2
        biner = str(sisa) + biner
        desimal1 //= 2
    print('Biner =', biner)

# Okta
    okta = ''
    desimal2 = desimal
    while desimal2 > 0:
        sisa = desimal2 % 8
        okta = str(sisa) + okta
        desimal2 //= 8
    print('Okta =', okta)

# Hexa
    hexa = ''
    desimal3 = desimal
    while desimal3 > 0:
        sisa = desimal3 % 16
        if sisa < 10:
            hexa = str(sisa) + hexa
        else:
            hexa = chr(ord('A') + sisa - 10) + hexa
        desimal3 //= 16
    print('Hexa =', hexa)

Desimal = 66
Biner = 1000010
Okta = 102
Hexa = 42
Desimal = 97
Biner = 1100001
Okta = 141
Hexa = 61
Desimal = 84
Biner = 1010100
Okta = 124
Hexa = 54

In [23]:
#TUGAS PERULANGAN

s=12
wadah = []
while s<19:
    wadah.append(s)
    s=s+1
i=0
for i in wadah[:4]:
    print (i)
print('Berhasil Running hingga =', s)
print('selesai')

12
13
14
15
Berhasil Running hingga = 19
selesai

In [11]:
#ISI FILE
source_data=open('source/data.txt','a')
source_data.write('Jum, 2 Feb 2024 | 08:55')
source_data.close()

#OPEN
source_data=open('source/data.txt')
cetak_data=source_data.read()
print(cetak_data)
# print(cetak_data[0],cetak_data[1],cetak_data[2])
source_data.close()

nama : Fadeli Dwi Priyanta
PN   : 00345975
kode_peserta : BFLP001SY004
Jum, 2 Feb 2024 | 08:55

In [12]:
f=open('source/data.txt','r+')
f.write("Pelatihan kita di LPPI \nkemang dengan waktu yang telah ditentukan!!")
f.seek(0)
print(f.read())
f.close()

Pelatihan kita di LPPI
kemang dengan waktu yang telah ditentukan!!!

In [16]:
f=open('source/data.txt','r+')
baca=f.readlines()
kalimat_tambahan = "dari pagi sampai sore.\n"
baca.insert(1, kalimat_tambahan)

f.seek(0)
f.writelines(baca)

f.seek(0)
print(f.read())

Pelatihan kita di LPPI
dari pagi sampai sore.
dari pagi sampai sore.
kemang dengan waktu yang telah ditentukan!!!

In [17]:
f=open('source/data.txt','r+')
baca=f.readlines()
del baca [1]
f.seek(0)
f.writelines(baca)

f.seek(0)
print(f.read())

Pelatihan kita di LPPI
dari pagi sampai sore.
kemang dengan waktu yang telah ditentukan!!!ang telah ditentukan!!!

In [18]:
karakter_input = input('Nama: ')
for karakter in karakter_input:
    desimal = ord(karakter)

    # Desimal
    print('Desimal untuk', karakter, '=', desimal)

    # Biner
    biner = ''
    desimal1 = desimal
    while desimal1 > 0:
        sisa = desimal1 % 2
        biner = str(sisa) + biner
        desimal1 //= 2
    print('Biner untuk', karakter, '=', biner)

    # Okta
    okta = ''
    desimal2 = desimal
    while desimal2 > 0:
        sisa = desimal2 % 8
        okta = str(sisa) + okta
        desimal2 //= 8
    print('Okta untuk', karakter, '=', okta)

    # Hexa
    hexa = ''
    desimal3 = desimal
    while desimal3 > 0:
        sisa = desimal3 % 16
        if sisa < 10:
            hexa = str(sisa) + hexa
        else:
            hexa = chr(ord('A') + sisa - 10) + hexa
        desimal3 //= 16
    print('Hexa untuk', karakter, '=', hexa)

    print('-' * 20)

Nama: ANI
Desimal untuk A = 65
Biner untuk A = 1000001
Okta untuk A = 101
Hexa untuk A = 41
--------------------
Desimal untuk N = 78
Biner untuk N = 1001110
Okta untuk N = 116
Hexa untuk N = 4E
--------------------
Desimal untuk I = 73
Biner untuk I = 1001001
Okta untuk I = 111
Hexa untuk I = 49
--------------------

In [31]:
def konversi_karakter(input_nama,ruang,skema, output_file):
    with open(output_file, 'r+') as output:
        output.write(f'Nama : {input_nama}\n')
        output.write(f'Ruang : {ruang}\n')
        output.write(f'Skema : {skema}\n\n')
        
        for karakter in input_nama:
            desimal = ord(karakter)

            # Desimal
            print(f'Desimal untuk {karakter} = {desimal}')
            output.write(f'Desimal untuk {karakter} = {desimal}\n')

            # Biner
            biner = ''
            desimal1 = desimal
            while desimal1 > 0:
                sisa = desimal1 % 2
                biner = str(sisa) + biner
                desimal1 //= 2
            print(f'Biner untuk {karakter} = {biner}')
            output.write(f'Biner untuk {karakter} = {biner}\n')

            # Okta
            okta = ''
            desimal2 = desimal
            while desimal2 > 0:
                sisa = desimal2 % 8
                okta = str(sisa) + okta
                desimal2 //= 8
            print(f'Okta untuk {karakter} = {okta}')
            output.write(f'Okta untuk {karakter} = {okta}\n')

            # Hexa
            hexa = ''
            desimal3 = desimal
            while desimal3 > 0:
                sisa = desimal3 % 16
                if sisa < 10:
                    hexa = str(sisa) + hexa
                else:
                    hexa = chr(ord('A') + sisa - 10) + hexa
                desimal3 //= 16
            print(f'Hexa untuk {karakter} = {hexa}')
            output.write(f'Hexa untuk {karakter} = {hexa}\n')
            print('-' * 20 + '\n')
            output.write('-' * 20 + '\n')  # Separator between characters


            
karakter_input = input('Nama: ')
ruang = input('Ruang: ')
skema = input('Skema: ')

output_file_path = 'source/handling.txt'
konversi_karakter(karakter_input,ruang,skema, output_file_path)
print(f'Hasil konversi telah disimpan di {output_file_path}')

Nama: Fadeli
Ruang: 212
Skema: System Engineer
Desimal untuk F = 70
Biner untuk F = 1000110
Okta untuk F = 106
Hexa untuk F = 46
--------------------

Desimal untuk a = 97
Biner untuk a = 1100001
Okta untuk a = 141
Hexa untuk a = 61
--------------------

Desimal untuk d = 100
Biner untuk d = 1100100
Okta untuk d = 144
Hexa untuk d = 64
--------------------

Desimal untuk e = 101
Biner untuk e = 1100101
Okta untuk e = 145
Hexa untuk e = 65
--------------------

Desimal untuk l = 108
Biner untuk l = 1101100
Okta untuk l = 154
Hexa untuk l = 6C
--------------------

Desimal untuk i = 105
Biner untuk i = 1101001
Okta untuk i = 151
Hexa untuk i = 69
--------------------

Hasil konversi telah disimpan di source/handling.txt

In [24]:
#TUGAS 1 tampil tidak rapih
import mysql.connector

mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="warmad123",
    database="sakila"
)

mycursor=mysql.connector.connect(
    host='localhost',
    user='root',
    password='warmad123',
    database='sakila'
)

mycursor=mydb.cursor()

mycursor.execute('select * from actor limit 5')
myresult=mycursor.fetchall()

print(myresult)

[(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (2, 'NICK', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33)), (3, 'ED', 'CHASE', datetime.datetime(2006, 2, 15, 4, 34, 33)), (4, 'JENNIFER', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33)), (5, 'JOHNNY', 'LOLLOBRIGIDA', datetime.datetime(2006, 2, 15, 4, 34, 33))]

In [21]:
#TUGAS 2 Tampil rapih menggunakan pandas

import mysql.connector
import pandas as pd


mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="warmad123",
    database="sakila"
)

mycursor = mydb.cursor()

# Inserting data into 'divisi'
# mycursor.execute("insert into divisi values ('190','232','Bakawan')")
# mydb.commit()

mycursor.execute('SELECT * FROM actor')
myresult = mycursor.fetchall()
# print(myresult)
# Close cursor and connection
df = pd.DataFrame(myresult, colums=columns).head(30)
print(df)
mycursor.close()
mydb.close()

     0          1             2                   3
0    1   PENELOPE       GUINESS 2006-02-15 04:34:33
1    2       NICK      WAHLBERG 2006-02-15 04:34:33
2    3         ED         CHASE 2006-02-15 04:34:33
3    4   JENNIFER         DAVIS 2006-02-15 04:34:33
4    5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5    6      BETTE     NICHOLSON 2006-02-15 04:34:33
6    7      GRACE        MOSTEL 2006-02-15 04:34:33
7    8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8    9        JOE         SWANK 2006-02-15 04:34:33
9   10  CHRISTIAN         GABLE 2006-02-15 04:34:33
10  11       ZERO          CAGE 2006-02-15 04:34:33
11  12       KARL         BERRY 2006-02-15 04:34:33
12  13        UMA          WOOD 2006-02-15 04:34:33
13  14     VIVIEN        BERGEN 2006-02-15 04:34:33
14  15       CUBA       OLIVIER 2006-02-15 04:34:33
15  16       FRED       COSTNER 2006-02-15 04:34:33
16  17      HELEN        VOIGHT 2006-02-15 04:34:33
17  18        DAN          TORN 2006-02-15 04:34:33
18  19        BOB       FAWCETT 2006-02-15 04:34:33
19  20    LUCILLE         TRACY 2006-02-15 04:34:33
20  21    KIRSTEN       PALTROW 2006-02-15 04:34:33
21  22      ELVIS          MARX 2006-02-15 04:34:33
22  23     SANDRA        KILMER 2006-02-15 04:34:33
23  24    CAMERON        STREEP 2006-02-15 04:34:33
24  25      KEVIN         BLOOM 2006-02-15 04:34:33
25  26        RIP      CRAWFORD 2006-02-15 04:34:33
26  27      JULIA       MCQUEEN 2006-02-15 04:34:33
27  28      WOODY       HOFFMAN 2006-02-15 04:34:33
28  29       ALEC         WAYNE 2006-02-15 04:34:33
29  30     SANDRA          PECK 2006-02-15 04:34:33

In [44]:
#TUGAS 3 Insert 
import mysql.connector
import pandas as pd


mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="warmad123",
    database="sakila"
)

mycursor = mydb.cursor()
mycursor.execute("insert into actor (first_name, last_name) values ('Fadeli','Dwi')")

mydb.commit()

mycursor.execute('SELECT * FROM actor')
myresult = mycursor.fetchall()
# print(myresult)
# Close cursor and connection

columns = []
for asc in mycursor.description:
    columns.append(asc[0])
    
# print('\nHEAD DATA')
df = pd.DataFrame(myresult, columns=columns).tail(5)
print(df)
mycursor.close()
mydb.close()

     actor_id first_name last_name         last_update
197       198       MARY    KEITEL 2006-02-15 04:34:33
198       199      JULIA   FAWCETT 2006-02-15 04:34:33
199       200      THORA    TEMPLE 2006-02-15 04:34:33
200       204    Kritian   Girsang 2024-02-02 13:50:38
201       205     Fadeli       Dwi 2024-02-02 14:05:56

In [69]:
#TUGAS 4 Update 
import mysql.connector
import pandas as pd


mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="warmad123",
    database="sakila"
)

mycursor = mydb.cursor()
mycursor.execute("update actor set last_name='Dwi' where actor_id=201 ")
mydb.commit()

mycursor.execute('SELECT * FROM actor')
myresult = mycursor.fetchall()

columns = []
for asc in mycursor.description:
    columns.append(asc[0])
    

df = pd.DataFrame(myresult, columns=columns)
print(df)
mycursor.close()
mydb.close()

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
199       200      THORA        TEMPLE 2006-02-15 04:34:33
200       204    Kritian       Girsang 2024-02-02 13:50:38
201       205     Fadeli           Dwi 2024-02-02 14:05:56
202       206      Dimas         akbar 2024-02-02 14:14:29
203       207      Akbar        Faisal 2024-02-02 14:19:54

[204 rows x 4 columns]

In [105]:
#Tugas 5 delete 
import mysql.connector
import pandas as pd

def query(sql,angka):
    mydb = mysql.connector.connect(
        host="localhost",
        user="root",
        password="warmad123",
        database="sakila"
    )
    mycursor = mydb.cursor()
    mycursor.execute(sql)
#     mydb.commit()

#     mycursor.execute('SELECT * FROM actor')
    myresult = mycursor.fetchall()

    columns = []
    for asc in mycursor.description:
        columns.append(asc[0])


    df = pd.DataFrame(myresult, columns=columns).tail(int(angka))
    print(df)
    mycursor.close()
    mydb.close()

In [57]:
querys= "insert into actor (first_name, last_name) values ('Akbar','Faisal')"
query(querys,4)

     actor_id first_name last_name         last_update
200       204    Kritian   Girsang 2024-02-02 13:50:38
201       205     Fadeli       Dwi 2024-02-02 14:05:56
202       206      Dimas     akbar 2024-02-02 14:14:29
203       207      Akbar    Faisal 2024-02-02 14:19:54

In [55]:
df.dtypes

actor_id                int64
first_name             object
last_name              object
last_update    datetime64[ns]
dtype: object

In [56]:
df.nunique()

actor_id       5
first_name     5
last_name      5
last_update    3
dtype: int64

In [58]:
df['actor_id'].value_counts()

198    1
199    1
200    1
204    1
205    1
Name: actor_id, dtype: int64

In [60]:
df['first_name'].value_counts()

MARY       1
JULIA      1
THORA      1
Kritian    1
Fadeli     1
Name: first_name, dtype: int64

In [72]:
df.isnull().sum()

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

In [61]:
df.isnull()

     actor_id  first_name  last_name  last_update
197     False       False      False        False
198     False       False      False        False
199     False       False      False        False
200     False       False      False        False
201     False       False      False        False

In [70]:
df.shape

(204, 4)

In [4]:
#Tugas 5 delete 
import mysql.connector
import pandas as pd

def query(sql):
    mydb = mysql.connector.connect(
        host="localhost",
        user="root",
        password="warmad123",
        database="sakila"
    )
    mycursor = mydb.cursor()
    mycursor.execute(sql)
#     mydb.commit()

#     mycursor.execute('SELECT * FROM actor')
    myresult = mycursor.fetchall()

    columns = []
    for asc in mycursor.description:
        columns.append(asc[0])


    df = pd.DataFrame(myresult, columns=columns)
    print(df)
    mycursor.close()
    mydb.close()

In [8]:
querys="select city.city_id,city,address from city inner join address on city.city_id = address.city_id order by city.city_id asc"
df1=query(querys)

     city_id                  city                               address
0          1  A Coruña (La Coruña)                  939 Probolinggo Loop
1          2                  Abha                 733 Mandaluyong Place
2          3             Abu Dhabi                  535 Ahmadnagar Manor
3          4                 Acuña              1789 Saint-Denis Parkway
4          5                 Adana              663 Bahía Blanca Parkway
..       ...                   ...                                   ...
598      596                 Zaria                     885 Yingkou Manor
599      597          Zeleznogorsk                       1378 Beira Loop
600      598           Zhezqazghan  521 San Juan Bautista Tuxtepec Place
601      599              Zhoushan                   346 Cam Ranh Avenue
602      600            Ziguinchor                     1889 Valparai Way

[603 rows x 3 columns]

In [10]:

print(df1.loc[df['city_id']==n,['city']])

AttributeError: 'NoneType' object has no attribute 'loc'

In [131]:
#TUGAS SORE

mydb = mysql.connector.connect(
        host="localhost",
        user="root",
        password="warmad123",
        database="sakila"
)
mycursor = mydb.cursor()
mycursor.execute("select city.city_id,city,address from city inner join address on city.city_id = address.city_id order by city.city_id asc")
myresult = mycursor.fetchall()

columns = []
for asc in mycursor.description:
    columns.append(asc[0])


df = pd.DataFrame(myresult, columns=columns)
print(df)
mycursor.close()
mydb.close()

     city_id                  city                               address
0          1  A Coruña (La Coruña)                  939 Probolinggo Loop
1          2                  Abha                 733 Mandaluyong Place
2          3             Abu Dhabi                  535 Ahmadnagar Manor
3          4                 Acuña              1789 Saint-Denis Parkway
4          5                 Adana              663 Bahía Blanca Parkway
..       ...                   ...                                   ...
598      596                 Zaria                     885 Yingkou Manor
599      597          Zeleznogorsk                       1378 Beira Loop
600      598           Zhezqazghan  521 San Juan Bautista Tuxtepec Place
601      599              Zhoushan                   346 Cam Ranh Avenue
602      600            Ziguinchor                     1889 Valparai Way

[603 rows x 3 columns]

In [138]:
n=1
while n<60:
    selected=df.loc[df['city_id'] == n, ['city', 'address']]
    print(selected)
    n=n+1

                   city               address
0  A Coruña (La Coruña)  939 Probolinggo Loop
   city                address
1  Abha  733 Mandaluyong Place
        city               address
2  Abu Dhabi  535 Ahmadnagar Manor
    city                   address
3  Acuña  1789 Saint-Denis Parkway
    city                   address
4  Adana  663 Bahía Blanca Parkway
          city              address
5  Addis Abeba  614 Pak Kret Street
   city        address
6  Aden  751 Lima Loop
    city          address
7  Adoni  230 Urawa Drive
         city              address
8  Ahmadnagar  922 Vila Velha Loop
       city                address
9  Akishima  923 Tangail Boulevard
     city                 address
10  Akron  98 Pyongyang Boulevard
      city             address
11  al-Ayn  669 Firozabad Loop
         city                  address
12  al-Hawiya  1124 Buenaventura Drive
         city                 address
13  al-Manama  1759 Niznekamsk Avenue
          city                    address
14  al-Qadarif  1152 Citrus Heights Manor
        city                address
15  al-Qatif  289 Santo André Manor
           city                    address
16  Alessandria  127 Purnea (Purnia) Manor
                     city               address
17  Allappuzha (Alleppey)  431 Xi´angtan Avenue
       city               address
18  Allende  397 Sunnyvale Avenue
               city               address
19  Almirante Brown  1623 Kingstown Drive
        city                     address
20  Alvorada  1407 Pachuca de Soto Place
        city          address
21  Ambattur  1014 Loja Manor
          city              address
22  Amersfoort  992 Klerksdorp Loop
      city           address
23  Amroha  949 Allende Lane
              city             address
24  Angra dos Reis  1354 Siegen Street
        city            address
25  Anápolis  356 Olomouc Manor
           city               address
26  Antofagasta  1718 Valencia Street
                    city             address
27  Aparecida de Goiânia  1201 Qomsheh Manor
         city            address
28  Apeldoorn  1749 Daxian Place
         city        address
29  Araçatuba  1692 Ede Loop
    city                    address
30  Arak  334 Munger (Monghyr) Lane
       city             address
31  Arecibo  1009 Zanzibar Lane
         city                           address
32  Arlington  913 Coacalco de Berriozábal Loop
      city          address
33  Ashdod  659 Vaduz Drive
        city               address
34  Ashgabat  387 Mwene-Ditu Drive
        city                        address
35  Ashqelon  632 Usolje-Sibirskoje Parkway
        city               address
36  Asunción  201 Effon-Alaiye Way
       city            address
37  Athenai  692 Joliet Street
       city             address
38  Atšinsk  616 Hagonoy Avenue
       city                           address
39  Atlixco  125 Città del Vaticano Boulevard
                       city           address
40  Augusta-Richmond County  1308 Arecibo Way
      city             address
41  Aurora  587 Benguela Manor
42  Aurora    43 Vilnius Manor
          city                        address
43  Avellaneda  1229 Varanasi (Benares) Manor
    city       address
44  Bagé  1190 0 Place
            city                          address
45  Bahía Blanca  1427 A Coruña (La Coruña) Place
        city              address
46  Baicheng  183 Haiphong Street
      city          address
47  Baiyin  362 Rajkot Lane
    city                    address
48  Baku  431 Székesfehérvár Avenue
        city                            address
49  Balašiha  1697 Kowloon and New Kowloon Loop
         city              address
50  Balikesir  1912 Emeishan Drive
         city               address
51  Balurghat  624 Oshawa Boulevard
       city              address
52  Bamenda  1641 Changhwa Place
                   city              address
53  Bandar Seri Begawan  1370 Le Mans Avenue
      city             address
54  Banjul  247 Jining Parkway
         city                      address
55  Barcelona  502 Mandi Bahauddin Parkway
     city          address
56  Basel  915 Ponce Place
       city                    address
57  Bat Yam  1542 Lubumbashi Boulevard
      city            address
58  Batman  29 Pyongyang Loop
     city                 address
59  Batna  1924 Shimonoseki Drive

In [18]:
# FUNGSI UNTUK DIPANGGIL
def execute_query(query):
    mydb = mysql.connector.connect(
        host="localhost",
        user="root",
        password="warmad123",
        database="sakila"
    )
    mycursor = mydb.cursor()
    mycursor.execute(query)
    result = mycursor.fetchall()
    
    columns = []
    for asc in mycursor.description:
        columns.append(asc[0])

    df = pd.DataFrame(result, columns=columns)
    mycursor.close()
    mydb.close()
    return df

def print_selected_data(df):
    n = 1
    while n < 60:
        selected = df.loc[df['city_id'] == n, ['city', 'address']]
        print(selected)
        n += 1

In [20]:
# df=execute_query("select city.city_id,city,address from city inner join address on city.city_id = address.city_id order by city.city_id asc")
df=execute_query("select * from actor")
print()

# print_selected_data(df)